## Pandas Basics
The Pandas library is one of the most preferred tools for data analytics professionals to do perform data manipulation, wrangling, and analysis. Pandas was built on Numpy library, which makes it relatively fast and flixible. Most of the functions and structures in Pandas are expressive, and they are designed to make real-world data analysis significantly easier. Below we will see a few examples of important pandas structures and functions.

In [1]:
# let's first import pandas and numpy
import numpy as np
import pandas as pd

## Pandas Data Structures
### Series

Series data structure is a one-dimensional labeled array capable of holding any data type. Creating a Series by passing a list of values (letting pandas create a default integer index) can be done as follows:

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
# we can also create a Series object using a given index
s = pd.Series([3, -5, 7, 4],  index=['a',  'b',  'c',  'd'])
s

a    3
b   -5
c    7
d    4
dtype: int64

## DataFrame
DataFrame is a two-dimensional labeled data structure with columns of potentially different types. We can create a DataFrame by passing a random NumPy array:

In [4]:
df = pd.DataFrame(np.random.randn(6, 4)) # random 2d array of size 6 by 4
df

          0         1         2         3
0  0.431270 -0.815842  1.586834 -1.162832
1 -0.343270  0.040853 -1.576487 -0.553682
2  0.088586 -1.312286  0.009018 -0.566689
3 -1.424849  0.250138  0.784227  0.823569
4 -0.324808  0.181887 -0.006327 -0.293920
5  0.694692 -0.842512  0.788125  1.237054

In [5]:
df = pd.DataFrame() # this will be the empty data frame (no data, no columns, no rows)
df

Empty DataFrame
Columns: []
Index: []

In [6]:
# we can also create custom indices and columns
mycols = list("ABCD")
print(mycols)

dates = pd.date_range("20130101", periods=6) # 6 day period from 2013-01-01 to 2013-01-06

dates

['A', 'B', 'C', 'D']

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

df

                   A         B         C         D
2013-01-01 -1.845751 -1.275176 -0.067372  1.466416
2013-01-02  1.053998  0.949868 -0.287248 -0.829669
2013-01-03  1.901095 -0.339601  0.033673  0.755697
2013-01-04  0.142707  1.340806  0.608632 -0.095808
2013-01-05 -0.141989 -0.740192 -0.069407 -0.012224
2013-01-06 -1.303797  1.489631 -0.046871  0.805326

We can create a DataFrame by passing a dict of objects that can be converted to series-like.

In [8]:
data = { 'Country': ['Belgium',  'India',  'Brazil'],
         'Capital': ['Brussels',  'New Delhi',  'Brasilia'],
         'Population': [11190846, 1303171035, 207847528]
       }

df_capitals = pd.DataFrame(data,columns=['Country',  'Capital',  'Population'])
df_capitals

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [9]:
# another example with mixed data types and more specifications
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
# checking the columns of the resulting DataFrame have different dtypes.
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing data
We can view the top and bottom rows of the frame using `head` and `tail`

In [11]:
df.head()

                   A         B         C         D
2013-01-01 -1.845751 -1.275176 -0.067372  1.466416
2013-01-02  1.053998  0.949868 -0.287248 -0.829669
2013-01-03  1.901095 -0.339601  0.033673  0.755697
2013-01-04  0.142707  1.340806  0.608632 -0.095808
2013-01-05 -0.141989 -0.740192 -0.069407 -0.012224

In [12]:
df.tail()

                   A         B         C         D
2013-01-02  1.053998  0.949868 -0.287248 -0.829669
2013-01-03  1.901095 -0.339601  0.033673  0.755697
2013-01-04  0.142707  1.340806  0.608632 -0.095808
2013-01-05 -0.141989 -0.740192 -0.069407 -0.012224
2013-01-06 -1.303797  1.489631 -0.046871  0.805326

In [13]:
# we can see the (row) index and the columns
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [58]:
# describe() shows a quick statistic summary of your data:
df.describe()

              A         B         C    D         F
count  6.000000  6.000000  6.000000  6.0  5.000000
mean   0.275336  0.450085  0.028568  5.0  3.000000
std    1.096415  0.934533  0.303557  0.0  1.581139
min   -1.303797 -0.740192 -0.287248  5.0  1.000000
25%   -0.106492 -0.254701 -0.068898  5.0  2.000000
50%    0.071353  0.474934 -0.057121  5.0  3.000000
75%    0.826175  1.243071  0.013537  5.0  4.000000
max    1.901095  1.489631  0.608632  5.0  5.000000

In [16]:
# Transposing data:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.845751    1.053998    1.901095    0.142707   -0.141989   -1.303797
B   -1.275176    0.949868   -0.339601    1.340806   -0.740192    1.489631
C   -0.067372   -0.287248    0.033673    0.608632   -0.069407   -0.046871
D    1.466416   -0.829669    0.755697   -0.095808   -0.012224    0.805326

In [17]:
#Sorting by an axis:

df.sort_index(axis=1, ascending=False) # axis 0 is index, 1 is columns

                   D         C         B         A
2013-01-01  1.466416 -0.067372 -1.275176 -1.845751
2013-01-02 -0.829669 -0.287248  0.949868  1.053998
2013-01-03  0.755697  0.033673 -0.339601  1.901095
2013-01-04 -0.095808  0.608632  1.340806  0.142707
2013-01-05 -0.012224 -0.069407 -0.740192 -0.141989
2013-01-06  0.805326 -0.046871  1.489631 -1.303797

In [18]:
# You can sort values by a specific column as well
df.sort_values(by="B")

                   A         B         C         D
2013-01-01 -1.845751 -1.275176 -0.067372  1.466416
2013-01-05 -0.141989 -0.740192 -0.069407 -0.012224
2013-01-03  1.901095 -0.339601  0.033673  0.755697
2013-01-02  1.053998  0.949868 -0.287248 -0.829669
2013-01-04  0.142707  1.340806  0.608632 -0.095808
2013-01-06 -1.303797  1.489631 -0.046871  0.805326

## Selection

We can select and manipulate data using Pandas-optimized helper functions. We will see a few examples of these functions below:

In [19]:
# selecting a column
df['A'] # return a Series object (1D)

2013-01-01   -1.845751
2013-01-02    1.053998
2013-01-03    1.901095
2013-01-04    0.142707
2013-01-05   -0.141989
2013-01-06   -1.303797
Freq: D, Name: A, dtype: float64

In [20]:
# Selecting via [], which slices the rows.
df[0:3]

                   A         B         C         D
2013-01-01 -1.845751 -1.275176 -0.067372  1.466416
2013-01-02  1.053998  0.949868 -0.287248 -0.829669
2013-01-03  1.901095 -0.339601  0.033673  0.755697

In [21]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  1.053998  0.949868 -0.287248 -0.829669
2013-01-03  1.901095 -0.339601  0.033673  0.755697
2013-01-04  0.142707  1.340806  0.608632 -0.095808

#### Select via a label

In [22]:
print(dates[0])
df.loc[dates[0]] # returns a cross-section (or just one row as a labeled 1d structure)

2013-01-01 00:00:00

A   -1.845751
B   -1.275176
C   -0.067372
D    1.466416
Name: 2013-01-01 00:00:00, dtype: float64

In [23]:
# Selecting on a multi-axis by label:

df.loc[:, ["A", "B"]] # select all rows (using :) and 'A' and 'B' columns

                   A         B
2013-01-01 -1.845751 -1.275176
2013-01-02  1.053998  0.949868
2013-01-03  1.901095 -0.339601
2013-01-04  0.142707  1.340806
2013-01-05 -0.141989 -0.740192
2013-01-06 -1.303797  1.489631

In [24]:
# label slicing, both endpoints are included:

df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  1.053998  0.949868
2013-01-03  1.901095 -0.339601
2013-01-04  0.142707  1.340806

In [25]:
# get one row and two columns of the returned object:
df.loc["20130102", ["A", "B"]]

A    1.053998
B    0.949868
Name: 2013-01-02 00:00:00, dtype: float64

In [26]:
# For getting a scalar value:
print( df.loc[dates[0], "A"])

#For getting fast access to a scalar (equivalent to the prior method):
df.at[dates[0], "A"]

-1.8457510631933856

-1.8457510631933856

#### Selection by position

In [27]:
#  Select via the position of the passed integers
df.iloc[3] # returns the labeled row at index position 3

A    0.142707
B    1.340806
C    0.608632
D   -0.095808
Name: 2013-01-04 00:00:00, dtype: float64

In [28]:
# selection by integer slices, similar to NumPy or standard Python:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.142707  1.340806
2013-01-05 -0.141989 -0.740192

In [29]:
# By lists of integer position locations, similar to the NumPy/Python style:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  1.053998 -0.287248
2013-01-03  1.901095  0.033673
2013-01-05 -0.141989 -0.069407

In [30]:
# For slicing rows explicitly:
df.iloc[1:3, :] # returns all columns for positions 1 and 2 (1:3 returns [1,2])

                   A         B         C         D
2013-01-02  1.053998  0.949868 -0.287248 -0.829669
2013-01-03  1.901095 -0.339601  0.033673  0.755697

In [31]:
# For slicing columns explicitly:

df.iloc[:, 1:3] # returns all rows for column positions 1 and 2 (1:3 returns [1,2])

                   B         C
2013-01-01 -1.275176 -0.067372
2013-01-02  0.949868 -0.287248
2013-01-03 -0.339601  0.033673
2013-01-04  1.340806  0.608632
2013-01-05 -0.740192 -0.069407
2013-01-06  1.489631 -0.046871

In [32]:
# For getting a value explicitly:

print(df.iloc[1, 1])
# For getting fast access to a scalar (equivalent to the prior method):

print(df.iat[1, 1])

0.9498679648012494
0.9498679648012494

#### Boolean indexing

In [33]:
# Using a single columns values to select data.
df[df["A"] > 0]

                   A         B         C         D
2013-01-02  1.053998  0.949868 -0.287248 -0.829669
2013-01-03  1.901095 -0.339601  0.033673  0.755697
2013-01-04  0.142707  1.340806  0.608632 -0.095808

In [34]:
# Selecting values from a DataFrame where a boolean condition is met.

df[df > 0] # for values <=0, returned dataframe will include nan's

                   A         B         C         D
2013-01-01       NaN       NaN       NaN  1.466416
2013-01-02  1.053998  0.949868       NaN       NaN
2013-01-03  1.901095       NaN  0.033673  0.755697
2013-01-04  0.142707  1.340806  0.608632       NaN
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06       NaN  1.489631       NaN  0.805326

In [35]:
# Using the isin() method for filtering
df2 = df.copy()

df2["E"] = ["one", "one", "two", "three", "four", "three"]

df2

                   A         B         C         D      E
2013-01-01 -1.845751 -1.275176 -0.067372  1.466416    one
2013-01-02  1.053998  0.949868 -0.287248 -0.829669    one
2013-01-03  1.901095 -0.339601  0.033673  0.755697    two
2013-01-04  0.142707  1.340806  0.608632 -0.095808  three
2013-01-05 -0.141989 -0.740192 -0.069407 -0.012224   four
2013-01-06 -1.303797  1.489631 -0.046871  0.805326  three

In [36]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  1.901095 -0.339601  0.033673  0.755697   two
2013-01-05 -0.141989 -0.740192 -0.069407 -0.012224  four

## Setting

In [37]:
#Setting a new column automatically aligns the data by the indexes.

s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

print(s1)

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [38]:
df["F"] = s1
df # see the first column

                   A         B         C         D    F
2013-01-01 -1.845751 -1.275176 -0.067372  1.466416  NaN
2013-01-02  1.053998  0.949868 -0.287248 -0.829669  1.0
2013-01-03  1.901095 -0.339601  0.033673  0.755697  2.0
2013-01-04  0.142707  1.340806  0.608632 -0.095808  3.0
2013-01-05 -0.141989 -0.740192 -0.069407 -0.012224  4.0
2013-01-06 -1.303797  1.489631 -0.046871  0.805326  5.0

In [39]:
# Setting values by label:

df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -1.275176 -0.067372  1.466416  NaN
2013-01-02  1.053998  0.949868 -0.287248 -0.829669  1.0
2013-01-03  1.901095 -0.339601  0.033673  0.755697  2.0
2013-01-04  0.142707  1.340806  0.608632 -0.095808  3.0
2013-01-05 -0.141989 -0.740192 -0.069407 -0.012224  4.0
2013-01-06 -1.303797  1.489631 -0.046871  0.805326  5.0

In [40]:
df.iat[0, 1]

-1.2751755044813518

In [41]:
df.iat[0, 1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.067372  1.466416  NaN
2013-01-02  1.053998  0.949868 -0.287248 -0.829669  1.0
2013-01-03  1.901095 -0.339601  0.033673  0.755697  2.0
2013-01-04  0.142707  1.340806  0.608632 -0.095808  3.0
2013-01-05 -0.141989 -0.740192 -0.069407 -0.012224  4.0
2013-01-06 -1.303797  1.489631 -0.046871  0.805326  5.0

In [42]:
# Setting by assigning with a NumPy array:

df.loc[:, "D"] = np.array([5] * len(df))

In [43]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.067372  5  NaN
2013-01-02  1.053998  0.949868 -0.287248  5  1.0
2013-01-03  1.901095 -0.339601  0.033673  5  2.0
2013-01-04  0.142707  1.340806  0.608632  5  3.0
2013-01-05 -0.141989 -0.740192 -0.069407  5  4.0
2013-01-06 -1.303797  1.489631 -0.046871  5  5.0

In [44]:
# setting multiple values satisfying a condition
df2 = df.copy()

df2[df2 > 0] = -df2 

df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.067372 -5  NaN
2013-01-02 -1.053998 -0.949868 -0.287248 -5 -1.0
2013-01-03 -1.901095 -0.339601 -0.033673 -5 -2.0
2013-01-04 -0.142707 -1.340806 -0.608632 -5 -3.0
2013-01-05 -0.141989 -0.740192 -0.069407 -5 -4.0
2013-01-06 -1.303797 -1.489631 -0.046871 -5 -5.0

### Missing data
pandas primarily uses the value `np.nan` to represent missing data. It is by default not included in computations. 

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [45]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"]) # first filter the last 2 rows
                                                                     # then add column E (all nan's)
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000 -0.067372  5  NaN NaN
2013-01-02  1.053998  0.949868 -0.287248  5  1.0 NaN
2013-01-03  1.901095 -0.339601  0.033673  5  2.0 NaN
2013-01-04  0.142707  1.340806  0.608632  5  3.0 NaN

In [46]:
df1.loc[dates[0]:dates[1], "E"] = 2 # set first two rows of column E to 2
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.067372  5  NaN  2.0
2013-01-02  1.053998  0.949868 -0.287248  5  1.0  2.0
2013-01-03  1.901095 -0.339601  0.033673  5  2.0  NaN
2013-01-04  0.142707  1.340806  0.608632  5  3.0  NaN

In [47]:
# To drop any rows that have missing data.
df1.dropna(how="any")

                   A         B         C  D    F    E
2013-01-02  1.053998  0.949868 -0.287248  5  1.0  2.0

In [48]:
# Filling missing data.

df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.067372  5  5.0  2.0
2013-01-02  1.053998  0.949868 -0.287248  5  1.0  2.0
2013-01-03  1.901095 -0.339601  0.033673  5  2.0  5.0
2013-01-04  0.142707  1.340806  0.608632  5  3.0  5.0

In [49]:
# To get the boolean mask where values are nan.

pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

### Operations

#### Stats
Operations in general exclude missing data.

In [50]:
#Performing a descriptive statistic:

In [51]:
df.mean() # mean of columns

A    0.275336
B    0.450085
C    0.028568
D    5.000000
F    3.000000
dtype: float64

In [52]:
df.mean(axis=1) # mean of rows

2013-01-01    1.233157
2013-01-02    1.543324
2013-01-03    1.719033
2013-01-04    2.018429
2013-01-05    1.609682
2013-01-06    2.027793
Freq: D, dtype: float64

In [53]:
df.std()
df.median()

A    0.071353
B    0.474934
C   -0.057121
D    5.000000
F    3.000000
dtype: float64

In [54]:
# Applying functions to the data:

df.apply(np.cumsum) # cumulative sum for column

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.067372   5   NaN
2013-01-02  1.053998  0.949868 -0.354620  10   1.0
2013-01-03  2.955093  0.610267 -0.320947  15   3.0
2013-01-04  3.097800  1.951073  0.287684  20   6.0
2013-01-05  2.955811  1.210880  0.218278  25  10.0
2013-01-06  1.652014  2.700511  0.171407  30  15.0

In [55]:
df.apply(np.cumsum, axis=1) # cumulative sum for row

                   A         B         C         D          F
2013-01-01  0.000000  0.000000 -0.067372  4.932628        NaN
2013-01-02  1.053998  2.003866  1.716618  6.716618   7.716618
2013-01-03  1.901095  1.561494  1.595167  6.595167   8.595167
2013-01-04  0.142707  1.483512  2.092144  7.092144  10.092144
2013-01-05 -0.141989 -0.882181 -0.951588  4.048412   8.048412
2013-01-06 -1.303797  0.185834  0.138963  5.138963  10.138963

In [56]:
df.apply(lambda x: x.max() - x.min()) # applying lambda functions

A    3.204892
B    2.229823
C    0.895880
D    0.000000
F    4.000000
dtype: float64